Tekla Open API Reference for Tekla Structures 2025
Polymesh Class
 The Polygon class represents a polygon object that has its corners at the given points.
 The Polygon class represents a polygon object that has its corners at the given points.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Polymesh
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Polymesh
<SerializableAttribute>
Public NotInheritable Class Polymesh
The Polymesh type exposes the following members.
Constructors
Name | Description
Polymesh
Initializes a new instance of the Polymesh class
Top
Properties
Name | Description
Brep
 Gets or sets the polymesh that forms the object geometry.
Top
Methods
Name | Description
CompareFingerprints
 Compares two fingerprints
Convert
 Converts a struct of polymeshes to a list of
FacetedBrep
.
ConvertInvalidInfoFromStruct
 Convert a struct of invalid info to a list of pairs of outer loop index and error code. Read indexes and error codes from the integer list.
ConvertToStruct
 Converts a
FacetedBrep
 to struct dot polymesh.
Fingerprint
 Gets fingerprint information for input brep
FromStruct
 Converts a struct of polymesh to a
FacetedBrep
.
GetSolidBrep
 Gets the cleaned Brep
ToStruct
 Converts a
FacetedBrep
 to dotnet polymesh struct.
Validate
 Converts a
FacetedBrep
 to a polymesh and validates.
Top
See Also
Reference
Tekla.Structures.Model Namespace